﻿﻿﻿﻿//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2015, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
//**********************************************************************
//<AMI_FHDR_START>
//
// Name:  <PILOT4Setup.uni>
//
// Description: SIO form string definitions.
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"

//If customer define the common logical device by themselves, add here.
#string STR_PILOT4_SIO_FORM                        #language eng "PILOT4 Super IO Configuration"
#string STR_PILOT4_SIO_FORM_HELP                   #language eng "System Super IO Chip Parameters."
#string STR_PILOT4_SIO_PROMPT                      #language eng "Super IO Chip"
#string STR_PILOT4                                 #language eng "PILOT4"

//
//Serial 1/2 Settings
//
//Below are possible resource setting for all serial port
#string STR_PILOT4_SERIAL_IO3E8_IRQ7               #language eng "IO=3E8h; IRQ=7;"
#string STR_PILOT4_SERIAL_IO2E8_IRQ7               #language eng "IO=2E8h; IRQ=7;"
#string STR_PILOT4_SERIAL_IO2F0_IRQ7               #language eng "IO=2F0h; IRQ=7;"
#string STR_PILOT4_SERIAL_IO2E0_IRQ7               #language eng "IO=2E0h; IRQ=7;"
#string STR_PILOT4_SERIAL_IO3E8_IRQX               #language eng "IO=3E8h; IRQ=3,4,5,6,7,9,10,11,12;"
#string STR_PILOT4_SERIAL_IO2E8_IRQX               #language eng "IO=2E8h; IRQ=3,4,5,6,7,9,10,11,12;"
#string STR_PILOT4_SERIAL_IO2F0_IRQX               #language eng "IO=2F0h; IRQ=3,4,5,6,7,9,10,11,12;"
#string STR_PILOT4_SERIAL_IO2E0_IRQX               #language eng "IO=2E0h; IRQ=3,4,5,6,7,9,10,11,12;"

//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2015, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
